## SQLite-tehtävät

#### Tehtävä 1. Lisää tarvittavat kirjastot ja tee `testi.db` niminen tietokanta (SQLite3)

In [237]:
import sqlite3
import pandas as pd

database_connection = sqlite3.connect('testi.db')

#### Tehtävä 2. Luo yhteys tietokantaan

In [238]:
c = database_connection.cursor()

#### Tehtävä 3. Tee tietokantaan seuraavanlainen taulu, jonka nimi on `henkilotaulu`:
    
| Nimi        | Ika           | Kengankoko  |
| ------------- |-------------| -----|
| Teppo      | 88 | 47 |
| Matti      | 34     | 39 |
| Ilona | 41      |    36 |
| Sonja | 32      |    37 |

In [239]:
# c.execute('''CREATE TABLE henkilotaulu (Nimi, Ika, Kengankoko)''')
# data_rows = [('Teppo', 88, 47), ('Matti', 34, 39), ('Ilona', 41, 36), ('Sonja', 32, 37)]

# for row in data_rows:
#    c.execute('''INSERT INTO henkilotaulu VALUES {0}'''.format(row))

# database_connection.commit()

In [240]:
data = c.execute('''SELECT * FROM henkilotaulu''')
retrieved_data = data.fetchall()
retrieved_data

[('Teppo', 88, 47), ('Matti', 34, 39), ('Ilona', 41, 36), ('Sonja', 32, 37)]

#### Tehtävä 4. Kun Taulu on tehty, niin hae taulu Pandasin DataFrame-objektiin ja lisää siihen sarake `Hatunkoko`, jonka jälkeen täytä se valitsemillasi arvoilla

In [241]:
# sql_query = '''SELECT * FROM henkilotaulu'''
# dataframe_from_sqlite = pd.read_sql(sql_query, database_connection)

#koot = [58, 59, 56, 57]
#dataframe_from_sqlite['Hatunkoko'] = koot
dataframe_from_sqlite
#dataframe_from_sqlite.to_sql(name='henkilotaulu', con=database_connection, if_exists='fail', index=False)

    Nimi  Ika  Kengankoko  Hatunkoko
0  Teppo   88          47         58
1  Matti   34          39         59
2  Ilona   41          36         56
3  Sonja   32          37         57

#### Tehtävä 5. Tee taulusta kopio, jonka nimi on `henkilotaulukopio` ja lisää siihen rivi valitsemillasi arvoilla

In [242]:
# sql_query2 = '''SELECT * FROM henkilotaulu'''
# dataframe_from_sqlite2 = pd.read_sql(sql_query2, database_connection)
# dataframe_from_sqlite2 = dataframe_from_sqlite2.append(pd.DataFrame({'Nimi':['Tiina'], 'Ika':[52], 'Kengankoko':[39], 'Hatunkoko': [57]}))
# dataframe_from_sqlite2.to_sql(name='henkilotaulukopio', con=database_connection, if_exists='fail', index=False)

dataframe_from_sqlite2

    Nimi  Ika  Kengankoko  Hatunkoko
0  Teppo   88          47        NaN
1  Matti   34          39        NaN
2  Ilona   41          36        NaN
3  Sonja   32          37        NaN
0  Tiina   52          39       57.0

#### Tehtävä 6. Tallenna lopuksi tietokannan muutokset ja sulje yhteys

In [243]:
# database_connection.commit()
# database_connection.close()